Plan output with a targeted command to avoid issue with NFS share

```
$ tf plan -var-file=projects/$CLUSTER_NAME.tfvars -out=$CLUSTER_NAME -target=azurerm_monitor_action_group.alerts -target=azurerm_monitor_metric_alert.disk_space_full_alert

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_action_group.alerts will be created
  + resource "azurerm_monitor_action_group" "alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "AlertsActionGroup"
      + resource_group_name = "2i2c-utoronto-cluster"
      + short_name          = "alertaction"

      + webhook_receiver {
          + name        = "callpagerdutyapi"
          + service_uri = "https://events.pagerduty.com/integration/5ebdc22d2399400cd0560e450b579333/enqueue"
        }
    }

  # azurerm_monitor_metric_alert.disk_space_full_alert will be created
  + resource "azurerm_monitor_metric_alert" "disk_space_full_alert" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when used disk space is > 7372.8 GB."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "Used disk space > 7372.8 GB on ead3521a-d994-4a44-a68d-b16e35642d5b"
      + resource_group_name      = "2i2c-utoronto-cluster"
      + scopes                   = [
          + "/subscriptions/ead3521a-d994-4a44-a68d-b16e35642d5b/resourceGroups/2i2c-utoronto-cluster/providers/Microsoft.Storage/storageAccounts/2i2cutorontohubstorage",
        ]
      + severity                 = 3
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "UsedCapacity"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 7372800000000
        }
    }

  # azurerm_storage_account.homes will be updated in-place
  ~ resource "azurerm_storage_account" "homes" {
      ~ allow_nested_items_to_be_public   = false -> true
        id                                = "/subscriptions/ead3521a-d994-4a44-a68d-b16e35642d5b/resourceGroups/2i2c-utoronto-cluster/providers/Microsoft.Storage/storageAccounts/2i2cutorontohubstorage"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "2i2cutorontohubstorage"
        tags                              = {}
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to
│ use it as part of an error message.
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding "azurerm_container_registry.container_registry" from prior state: unsupported attribute "georeplication_locations"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding "azurerm_kubernetes_cluster.jupyterhub" from prior state: unsupported attribute "addon_profile"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding "azurerm_kubernetes_cluster_node_pool.user_pool[\"usere8sv5\"]" from prior state: unsupported attribute "availability_zones"
╵
```